//---------------------------------------------------------------------------
#pragma once
//---------------------------------------------------------------------------
#include <boost/asio.hpp>
//---------------------------------------------------------------------------
#include "bulk_machine.h"
//---------------------------------------------------------------------------
class t_server;
//---------------------------------------------------------------------------
const size_t c_un_buf_length = 1024;
//---------------------------------------------------------------------------



class tcp_connect : public std::enable_shared_from_this<tcp_connect>
{

public:

  tcp_connect(boost::asio::ip::tcp::socket a_socket, 
    t_server& a_server, 
    size_t a_bulk_size);

  void start();

private:

  // заказываем чего-то читать:
  void do_read();
  // что-то пишем - пока не надо в этом задании:
  //void do_write(std::size_t length);


  // Обрабатываем то, что к нам пришло:
  int handle_some(const char* ap_data, std::size_t a_un_size);


  // обработка целой строки
  int handle_ready_str(const std::string& astr_data);


  // ********************** Данные *******************************

  boost::asio::ip::tcp::socket m_socket;

  // буфер, куда читаем из сокета:
  uint8_t m_buf[c_un_buf_length];

  // строчка, которая ещё не готова:
  std::string m_buf_not_ready_yet;



  // машина построчной отработки логики пачек
  // эта уже "собственная" для этого потока для обработки
  // динамических блоков
  impl::t_bulk_machine m_machine;




  // ссылка на основной сервер, там у нас одна общая на всех машина обработки
  // "обычных" пачек
  t_server& m_server;
};
//---------------------------------------------------------------------------

